In [3]:
import random
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

SEED = 42
random.seed(SEED)
np.random.seed(SEED)

In [5]:
base_df = pd.read_csv("data_1.csv", index_col=0)
base_df.head()

   score         salary  happiness  Age
0     80  141890.771857       61.0   62
1     47  130053.860492       80.0   71
2     56  102071.794659       40.0   67
3     37   90975.540309       21.0   27
4     70  109558.368794       41.0   77

In [6]:
base_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 993 entries, 0 to 992
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   score      993 non-null    int64
 1   salary     944 non-null    float64
 2   happiness  992 non-null    float64
 3   Age        993 non-null    int64
dtypes: float64(2), int64(2)
memory usage: 38.8 KB

In [7]:
base_df.describe()

            score         salary   happiness         Age
count  993.000000     944.000000  992.000000  993.000000
mean    49.085599  117623.694987   50.038306   50.032226
std     28.639333   43227.824717   29.732690   17.585304
min      0.000000 -164801.150081    1.000000   21.000000
25%     23.000000   93129.226078   21.000000   34.000000
50%     50.000000  117694.900454   41.000000   49.000000
75%     74.000000  144573.305876   80.000000   66.000000
max     99.000000  349110.332462  100.000000   80.000000